<a href="https://colab.research.google.com/github/AmmarSahyoun/Coursera-projects/blob/master/Pandas_Trics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [49]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies= pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price']= orders.item_price.str.replace('$','').astype('float')
stocks=pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
titanic=pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

In [3]:
pd.__version__

'1.0.5'

In [4]:
pd.show_versions() # pandas dependencies

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)
/usr/local/lib/python3.6/dist-packages/pandas_datareader/compat/__init__.py:7: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  from pandas.util.testing import assert_frame_equal

INSTALLED VERSIONS
------------------
commit           : None
python           : 3.6.9.final.0
python-bits      : 64
OS               : Linux
OS-release       : 4.19.112+
machine          : x86_64
processor        : x86_64
byteorder        : little
LC_ALL           : None
LANG             : en_US.UTF-8
LOCALE           : en_US.UTF-8

pandas           : 1.0.5
numpy            : 1.18.5
pytz             : 2018.9
dateutil         : 2.8.1
pip              : 19.3.1
setuptools       : 50.3.0
Cython           : 0.29.21
pytest           : 3.6.4
hypothesis       : None
sphinx           : 1.8.5
blosc            : None
feather          : 0.4.1
xlsxwriter       : None
lxml.etree       : 4.2.6
html5lib         : 1.0.1
pymysql          : None
psycopg2         : 2.7.6.1 (dt dec pq3 ext lo64)
jinja2           : 2.11.2
IPython          : 5.5.0
pandas_datareader: 0.8.1
bs4              : 4.6.3
bottleneck       : 1.3.2
fastparquet      : None
gcsfs            : None
lxml.etree       : 4.2.6
matplotlib       : 3.2.2
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 2.5.9
pandas_gbq       : 0.11.0
pyarrow          : 0.14.1
pytables         : None
pytest           : 3.6.4
pyxlsb           : None
s3fs             : None
scipy            : 1.4.1
sqlalchemy       : 1.3.19
tables           : 3.4.4
tabulate         : 0.8.7
xarray           : 0.15.1
xlrd             : 1.1.0
xlwt             : 1.3.0
xlsxwriter       : None
numba            : 0.48.0

## Create example dataframe

In [5]:
df = pd.DataFrame({'col one':[100, 200], 'col two': [300, 400]})
df

   col one  col two
0      100      300
1      200      400

In [6]:
pd.DataFrame(np.random.rand(4,8))

          0         1         2  ...         5         6         7
0  0.072787  0.215662  0.054105  ...  0.254721  0.638317  0.886334
1  0.011876  0.041946  0.790119  ...  0.793794  0.356902  0.789165
2  0.225955  0.336494  0.602079  ...  0.337644  0.345871  0.726452
3  0.113644  0.079094  0.714219  ...  0.579850  0.693220  0.682561

[4 rows x 8 columns]

In [7]:
pd.DataFrame(np.random.rand(4,8), columns=list('AmmarSAH'))

          A         m         m  ...         S         A         H
0  0.525519  0.320258  0.910416  ...  0.067075  0.973753  0.332022
1  0.066115  0.324127  0.738458  ...  0.287799  0.010987  0.964543
2  0.363496  0.895145  0.846476  ...  0.036605  0.282564  0.586090
3  0.413408  0.542097  0.671473  ...  0.640565  0.690020  0.175509

[4 rows x 8 columns]

### Rename Column

In [8]:
df

   col one  col two
0      100      300
1      200      400

In [9]:
df = df.rename({'col one': 'col_one', 'col two':'col_two'}, axis='columns')

In [10]:
df.columns= ['col_one', 'col_two']

In [11]:
df.columns = df.columns.str.replace(' ', '_')

In [12]:
df

   col_one  col_two
0      100      300
1      200      400

In [13]:
df.add_prefix('X_')

   X_col_one  X_col_two
0        100        300
1        200        400

In [14]:
df.add_suffix('X_')

   col_oneX_  col_twoX_
0        100        300
1        200        400

#### Reverse Row order

In [15]:
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [16]:
drinks.loc[::-1].head()

       country  beer_servings  ...  total_litres_of_pure_alcohol      continent
192   Zimbabwe             64  ...                           4.7         Africa
191     Zambia             32  ...                           2.5         Africa
190      Yemen              6  ...                           0.1           Asia
189    Vietnam            111  ...                           2.0           Asia
188  Venezuela            333  ...                           7.7  South America

[5 rows x 6 columns]

In [17]:
drinks.loc[::-1].tail()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
4       Angola            217  ...                           5.9     Africa
3      Andorra            245  ...                          12.4     Europe
2      Algeria             25  ...                           0.7     Africa
1      Albania             89  ...                           4.9     Europe
0  Afghanistan              0  ...                           0.0       Asia

[5 rows x 6 columns]

In [18]:
drinks.loc[::-1].reset_index(drop=True).head() # the rows in reverse order but the index is reset

     country  beer_servings  ...  total_litres_of_pure_alcohol      continent
0   Zimbabwe             64  ...                           4.7         Africa
1     Zambia             32  ...                           2.5         Africa
2      Yemen              6  ...                           0.1           Asia
3    Vietnam            111  ...                           2.0           Asia
4  Venezuela            333  ...                           7.7  South America

[5 rows x 6 columns]


### Reverse Column Order

In [19]:
drinks.loc[:,::-1].head()

  continent  total_litres_of_pure_alcohol  ...  beer_servings      country
0      Asia                           0.0  ...              0  Afghanistan
1    Europe                           4.9  ...             89      Albania
2    Africa                           0.7  ...             25      Algeria
3    Europe                          12.4  ...            245      Andorra
4    Africa                           5.9  ...            217       Angola

[5 rows x 6 columns]


### Select columns by data type

In [20]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [21]:
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [24]:
drinks.select_dtypes(include=['number', 'object', 'category', 'datetime']).head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [27]:
drinks.select_dtypes(exclude='number').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa


### Convert Strings to numbers

In [28]:
df= pd.DataFrame({'col_one':['1.1', '2.2', '3.3'],
                  'col_two':['4.4','5.5','6.6'],
                  'col_three':['7.7','8.8','_']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         _

In [29]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [30]:
df.astype({'col_one':'float', 'col_two':'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [31]:
pd.to_numeric(df.col_three, errors='coerce')  # to numeric function convert invalid value to NaN

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [32]:
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [33]:
df= df.apply(pd.to_numeric, errors='coerce').fillna(0) # apply the changes to df
df

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0

In [34]:
df.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object



### Reduce DataFrame size

In [35]:
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [36]:
cols = ['beer_servings', 'continent']
small_drinks=pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB


### Filter a DataFrame by Multiple Categories

In [38]:
movies.head()

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3          9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....

[5 rows x 6 columns]

In [39]:
movies.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [40]:
movies[(movies.genre == 'Action') | (movies.genre == 'Drama')| (movies.genre == 'Western')].head()

    star_rating  ...                                        actors_list
3           9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
5           8.9  ...  [u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals...
6           8.9  ...  [u'Clint Eastwood', u'Eli Wallach', u'Lee Van ...
9           8.9  ...  [u'Brad Pitt', u'Edward Norton', u'Helena Bonh...
11          8.8  ...  [u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'...

[5 rows x 6 columns]

In [41]:
movies[movies.genre.isin(['Action', 'Drama', 'Western'])].head()

    star_rating  ...                                        actors_list
3           9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
5           8.9  ...  [u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals...
6           8.9  ...  [u'Clint Eastwood', u'Eli Wallach', u'Lee Van ...
9           8.9  ...  [u'Brad Pitt', u'Edward Norton', u'Helena Bonh...
11          8.8  ...  [u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'...

[5 rows x 6 columns]

In [42]:
movies[~movies.genre.isin(['Action', 'Drama','Western'])].head() # reverse filter to execlude rather than include

   star_rating  ...                                        actors_list
0          9.3  ...  [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1          9.2  ...    [u'Marlon Brando', u'Al Pacino', u'James Caan']
2          9.1  ...  [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
4          8.9  ...  [u'John Travolta', u'Uma Thurman', u'Samuel L....
7          8.9  ...  [u'Elijah Wood', u'Viggo Mortensen', u'Ian McK...

[5 rows x 6 columns]


### Filter a DataFrame by largest categories

In [44]:
counts = movies.genre.value_counts()
counts

Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Adventure     75
Animation     62
Horror        29
Mystery       16
Western        9
Sci-Fi         5
Thriller       5
Film-Noir      3
Family         2
Fantasy        1
History        1
Name: genre, dtype: int64

In [45]:
counts.nlargest(3) #the series method nlargest select 3 largest values

Drama     278
Comedy    156
Action    136
Name: genre, dtype: int64

In [46]:
counts.nlargest(3).index

Index(['Drama', 'Comedy', 'Action'], dtype='object')

In [47]:
movies[movies.genre.isin(counts.nlargest(3).index)].head() # thus, only Drama,Comedy and action movies rewmain in the dataframe

    star_rating  ...                                        actors_list
3           9.0  ...  [u'Christian Bale', u'Heath Ledger', u'Aaron E...
5           8.9  ...  [u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals...
9           8.9  ...  [u'Brad Pitt', u'Edward Norton', u'Helena Bonh...
11          8.8  ...  [u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'...
12          8.8  ...  [u'Mark Hamill', u'Harrison Ford', u'Carrie Fi...

[5 rows x 6 columns]


### Handel missing Values

In [50]:
ufo.head()

                   City Colors Reported  ... State                Time
0                Ithaca             NaN  ...    NY 1930-06-01 22:00:00
1           Willingboro             NaN  ...    NJ 1930-06-30 20:00:00
2               Holyoke             NaN  ...    CO 1931-02-15 14:00:00
3               Abilene             NaN  ...    KS 1931-06-01 13:00:00
4  New York Worlds Fair             NaN  ...    NY 1933-04-18 19:00:00

[5 rows x 5 columns]

In [51]:
ufo.isna().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [52]:
ufo.isna().mean()

City               0.001371
Colors Reported    0.842004
Shape Reported     0.144948
State              0.000000
Time               0.000000
dtype: float64

In [53]:
ufo.dropna(axis='columns').head()  # drop the columns that contain any missing value

  State                Time
0    NY 1930-06-01 22:00:00
1    NJ 1930-06-30 20:00:00
2    CO 1931-02-15 14:00:00
3    KS 1931-06-01 13:00:00
4    NY 1933-04-18 19:00:00

In [56]:
ufo.dropna(thresh=len(ufo)*0.9, axis='columns').head() # keep the columns in wich at least 90% of values are not missing

                   City State                Time
0                Ithaca    NY 1930-06-01 22:00:00
1           Willingboro    NJ 1930-06-30 20:00:00
2               Holyoke    CO 1931-02-15 14:00:00
3               Abilene    KS 1931-06-01 13:00:00
4  New York Worlds Fair    NY 1933-04-18 19:00:00

### Aggregate by multiple functions  ((groupBy))

In [57]:
orders.head()

   order_id  ...  item_price
0         1  ...        2.39
1         1  ...        3.39
2         1  ...        3.39
3         1  ...        2.39
4         2  ...       16.98

[5 rows x 5 columns]

In [59]:
orders[orders.order_id==1].item_price.sum()

11.56

In [60]:
orders.groupby('order_id').item_price.sum().head()

order_id
1    11.56
2    16.98
3    12.67
4    21.00
5    13.70
Name: item_price, dtype: float64

In [62]:
orders.order_id.value_counts().unique()

array([23, 14, 12, 11, 10,  9,  8,  7,  6,  5,  4,  3,  2,  1])

In [63]:
orders.groupby('order_id').item_price.agg(['sum', 'count']).head()  # return: totalprice and numbers for each order_id

            sum  count
order_id
1         11.56      4
2         16.98      1
3         12.67      2
4         21.00      2
5         13.70      2


### Combine the output of an aggregation with a dataframe

In [64]:
orders.head()

   order_id  ...  item_price
0         1  ...        2.39
1         1  ...        3.39
2         1  ...        3.39
3         1  ...        2.39
4         2  ...       16.98

[5 rows x 5 columns]

In [66]:
orders.groupby('order_id').item_price.sum().head()

order_id
1    11.56
2    16.98
3    12.67
4    21.00
5    13.70
Name: item_price, dtype: float64

In [67]:
len(orders.groupby('order_id').item_price.sum())

1834

In [68]:
len(orders.item_price) # the output of SUM function is smaller than the input, that does not allow to add the result as new column

4622

In [70]:
total_price= orders.groupby('order_id').item_price.transform('sum') # use the transform to have the same number of examples
len(total_price)

4622

In [71]:
orders['total_price']=total_price
orders.head()

   order_id  quantity  ... item_price total_price
0         1         1  ...       2.39       11.56
1         1         1  ...       3.39       11.56
2         1         1  ...       3.39       11.56
3         1         1  ...       2.39       11.56
4         2         2  ...      16.98       16.98

[5 rows x 6 columns]


### Select a slice of rows and columns

In [72]:
titanic.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [73]:
titanic.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [75]:
titanic.describe().loc['min':'max']

     PassengerId  Survived  Pclass     Age  SibSp  Parch      Fare
min          1.0       0.0     1.0   0.420    0.0    0.0    0.0000
25%        223.5       0.0     2.0  20.125    0.0    0.0    7.9104
50%        446.0       0.0     3.0  28.000    0.0    0.0   14.4542
75%        668.5       1.0     3.0  38.000    1.0    0.0   31.0000
max        891.0       1.0     3.0  80.000    8.0    6.0  512.3292

In [78]:
titanic.describe().loc['min':'max',  'Pclass':'Parch']

     Pclass     Age  SibSp  Parch
min     1.0   0.420    0.0    0.0
25%     2.0  20.125    0.0    0.0
50%     3.0  28.000    0.0    0.0
75%     3.0  38.000    1.0    0.0
max     3.0  80.000    8.0    6.0

### Reshap a Multiindexed Series

In [80]:
titanic.Survived.mean()

0.3838383838383838

In [81]:
titanic.groupby('Sex').Survived.mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [83]:
titanic.groupby(['Sex', 'Pclass']).Survived.mean() # for every passengr sex and class it shows the survival rate

Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64

In [88]:
titanic.groupby(['Sex','Pclass']).Survived.mean().unstack() # unstack: reshape the multiindexed Series into DataFrame

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447


### Create a Pivot table

In [89]:
titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='mean') # values with aggregation function

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [90]:
titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='mean', margins=True)# add row/column totals

Pclass         1         2         3       All
Sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [91]:
titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='count', margins=True)# shows the number of records

Pclass    1    2    3  All
Sex
female   94   76  144  314
male    122  108  347  577
All     216  184  491  891

### Convert Continuous data into Categorical data

In [93]:
titanic.Age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [96]:
pd.cut(titanic.Age, bins=[0, 18, 25, 99], labels=['child', 'young adult', 'adult']).head(10)

0    young adult
1          adult
2          adult
3          adult
4          adult
5            NaN
6          adult
7          child
8          adult
9          child
Name: Age, dtype: category
Categories (3, object): [child < young adult < adult]

### Change display options

In [97]:
titanic.head() # age column has 1 decimal place but the fare has 4 decimal places

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [104]:
pd.set_option('display.float_format', '{:,.2f}'.format) #

In [105]:
titanic.head()  # it changes the display of the data

   PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
0            1         0       3  ...  7.25   NaN         S
1            2         1       1  ... 71.28   C85         C
2            3         1       3  ...  7.92   NaN         S
3            4         1       1  ... 53.10  C123         S
4            5         0       3  ...  8.05   NaN         S

[5 rows x 12 columns]

In [106]:
pd.reset_option('display.float_format') # reset back to the default

### style a data frame

In [107]:
stocks

        Date   Close    Volume Symbol
0 2016-10-03   31.50  14070500   CSCO
1 2016-10-03  112.52  21701800   AAPL
2 2016-10-03   57.42  19189500   MSFT
3 2016-10-04  113.00  29736800   AAPL
4 2016-10-04   57.24  20085900   MSFT
5 2016-10-04   31.35  18460400   CSCO
6 2016-10-05   57.64  16726400   MSFT
7 2016-10-05   31.59  11808600   CSCO
8 2016-10-05  113.05  21453100   AAPL

In [110]:
format_dict={'Date':'{:%m/%d/%y}', 'Close': '${:.2f}', 'Volume':'{:,}'}

In [111]:
stocks.style.format(format_dict)

In [112]:
(stocks.style.format(format_dict).hide_index().highlight_min('Close', color='red').highlight_max('Close', color='lightgreen'))

In [113]:
(stocks.style.format(format_dict).hide_index().background_gradient(subset='Volume', cmap='Blues'))

In [114]:
(stocks.style.format(format_dict).hide_index().bar('Volume', color='lightblue', align='zero').set_caption('Stock Prices from October 2016'))